def area(a, b): 
    '''
    Возвращает площадь прямоугольника, по его двум сторонам.
    
            Параметры:
                    a (int): Длина 1 стороны
                    b (int): Длина 1 стороны
                    
            Возвращаемое значение: 
                    rectangle_area (int): Площадь прямоугольника
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника, по его двум сторонам.
    
            Параметры:
                    a (int): Длина 1 стороны
                    b (int): Длина 1 стороны
                    
            Возвращаемое значение: 
                    rectangle_perimeter (int): Периметр прямоугольника
    '''
    return 2*(a + b)
