
def area(a):
    '''
    Возвращает площадь квадрата, по его стороне.
    
            Параметры:
                    a (int): Длина стороны квадрата
                    
            Возвращаемое значение: 
                    square_area (int): Площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата, по его стороне.
    
            Параметры:
                    a (int): Длина стороны квадрата
                    
            Возвращаемое значение: 
                    square_perimeter (int): Периметр квадрата
    '''
    return 4 * a
